app/controllers/teachers/registrations_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("first_name", "middle_name", "last_name", "phone_number", "email", "degree", "created_at", "updated_at", "password", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"