app/views/groups/_group.html.erb

SELECT COUNT(*) FROM "students" WHERE "students"."group_id" = $1  [["group_id", 1]]
---
  <strong class="card-text">Students count:</strong>
  <%= group.students.count %>