app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
---
    <% if current_student %>
      <% current_student.groups.each do |group| %>