app/controllers/students/registrations_controller.rb

INSERT INTO "students" ("first_name", "middle_name", "last_name", "group_id", "phone_number", "email", "created_at", "updated_at", "password", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
    def create
      @student = Student.new(student_params)

      respond_to do |format|
        if @student.save