app/controllers/application_controller.rb

  def welcome
    @links = Link.all
    @teachers = Teacher.all
    @students = Student.all
---
SELECT "teachers".* FROM "teachers"
SELECT "students".* FROM "students"

  def find_user_name(type, id)
    if type == "Student"
      Student.find(id).middle_name
    elsif type == "Teacher"
      Teacher.find(id).middle_name
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 ORDER BY "students"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 ORDER BY "teachers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]