app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("group_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 1], ["name", "CS31"], ["created_at", "2024-03-03 21:50:00.499791"], ["updated_at", "2024-03-03 21:50:00.499791"]]

  def remove_students
    @group = Group.find(params[:id])
    student_ids = params[:group][:student_ids]
    if student_ids.present?
      students = Student.where(id: student_ids)
      @group.students.delete(students)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "group_id" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["group_id", 2], ["updated_at", "2024-03-03 21:57:54.409131"], ["id", 3]]

  def destroy
    @group.destroy!
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]

  def set_captain
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]