app/controllers/marks_controller.rb

SELECT "marks".* FROM "marks"
---
  def index
    @marks = Mark.all