app/controllers/students_controller.rb

  def current_student
    current_student || Student.find_by(id: session[:student_id]) if session[:student_id]
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]