app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.includes(:teacher).all
---
SELECT "subjects".* FROM "subjects"

  def create
    @subject = Subject.new(subject_params)
    @subject.teacher = current_teacher

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("subject_id", "title", "description", "hours", "difficulty_level", "lessons_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @subject.update(subject_params)
---
UPDATE "subjects" SET "hours" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["hours", 5], ["updated_at", "2024-03-09 08:28:25.723752"], ["id", 2]]

  def destroy
    @subject.destroy!
---
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 1]]