app/controllers/teachers_controller.rb

  def update
    respond_to do |format|
      if @teacher.update(teacher_params)
---
UPDATE "teachers" SET "first_name" = $1, "middle_name" = $2, "last_name" = $3, "phone_number" = $4, "degree" = $5, "updated_at" = $6 WHERE "teachers"."id" = $7  [["first_name", "123"], ["middle_name", "123"], ["last_name", "123"], ["phone_number", "123"], ["degree", "123"], ["updated_at", "2024-03-10 13:32:43.021750"], ["id", 1]]